Repository: KristianNikulin/db-migrator
Catalog: src/locales/*/messages.po
Languages: ru

source: Add
ru: Добавить

source: Add column
ru: Добавить атрибут

source: Add new column
ru: Добавить новый атрибут

# addRelation
source: Add new relation
ru: Добавить новую связь

# deleteColumnModal
source: Are you sure want to delete column?
ru: Вы уверены, что хотите удалить этот атрибут?

# deleteTableModal
source: Are you sure want to delete table?
ru: Вы уверены, что хотите удалить эту таблицу?

# attention
source: Attention! If you cancel the migration, all unsaved changes will be deleted!
ru: Внимание! При отмене миграции все несохранённые изменения будут удалены!

source: Cancel
ru: Отмена

source: Cancel migration
ru: Отменить миграцию

# clickStartMigration
source: Click 'Start migration' button
ru: Нажмите кнопку 'Начать миграцию'

source: Column
ru: Атрибут

source: Column Name
ru: Название колонки

source: Column Type
ru: Тип данных колонки

# columnComment
source: Comment
ru: Описание

source: Confirm
ru: Подтвердить

# createTable
source: Create new table
ru: Создать новую таблицу

# deleteColumn
source: Delete this column
ru: Удалить этот атрибут

# deleteTable
source: Delete this table
ru: Удалить эту таблицу

source: Deploy changes
ru: Применить изменения

source: Discard changes
ru: Отменить изменения

source: Docs
ru: Документация

# fieldRequired
source: Field is required
ru: Это поле обязательное

# columnNullable
source: Is Nullable
ru: Может быть null

# columnUnique
source: Is Unique
ru: Поле уникальное

# notRecommended
source: It's not recommended to make relation with this column!
ru: Не рекомендуется делать связь с этим полем!

source: Migrator
ru: Мигратор

# noColumns
source: No columns available
ru: Нет доступных колонок

# columnRelationships
source: Relationships
ru: Связи между таблицами

source: Save
ru: Сохранить

# selectColumn
source: Select a column
ru: Выберите колонку

# selectTableModal
source: Select a table
ru: Выберите таблицу

# selectTable
source: Select table and column from your database schema
ru: Выберите таблицу и поле на схеме вашей базы данных

# serviceUnavailable
source: Service is currently unavailable
ru: Сервис недоступен

source: Settings
ru: Настройки

# startMigrating
source: Start migration
ru: Начать миграцию

source: Table
ru: Таблица

source: Table Name
ru: Название таблицы

# toBeginMigrating
source: To begin migrating your database, follow these steps
ru: Для начала миграции выполните следующие шаги
